Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/contracts_of_employment/index.html.txt.tmx
Source language: en
Languages: ga

source: The law specifies that contracts of employment must contain certain items and your employer must give you your terms of employment in written form
ga: Sonraíonn an dlí go mbeidh ar chonarthaí fostaíochta míreanna áirithe a chuimsiú agus ní mór d' fhostóir do thearmaí fostaíochta a thabhairt duit i bhfoirm scríofa

source: Changes to your contract of employment
ga: Athruithe ar do chonradh fostaíochta

source: Changes to your contract of employment may occur in a number of ways
ga: Tarlaíonn athruithe ar do chonradh fostaíochta ar bhealach difriúil

source: Find out how these changes can occur and what your rights and entitlements are as set down by law
ga: Faigh amach conas a tharlaíonn na hathruithe seo agus cad iad do chuid cearta agus teidlíochtaí mar a leagtha síos sa dlí

source: Fixed-term or specified-purpose contracts
ga: Conarthaí ar théarmaí seasta nó sainchuspóra

source: Employees on fixed-term contracts generally have the same employment rights as employees on open-ended contracts
ga: Tá na cearta atá ag fostaithe ar théarma seasta cosúil le cearta atá acu siúd ar chonarthaí neamhiata

source: Contracts without specific working hours (zero-hours contracts)
ga: Conarthaí gan uaireanta oibre sainiúla (conarthaí uaireanta-nialasacha)

source: Employees on zero-hours contracts have certain rights under the Organisation of Working Time Act 1997
ga: Tá cearta áirithe ag fostaithe a bhfuil conarthaí uaireanta-nialasacha acu faoin Acht um Eagrú Ama Oibre 1997

source: Protection given to an employee when the business he/she works for is transferred to a new owner
ga: Cosaint a thugtar d'fhostaí nuair a aistrítear an gnó ina bhfuil sé/sí ag obair chuig uinéir nua

source: Being asked to reduce your pay or your hours of work
ga: Nuair a iarrtar ort d'uaireanta oibre a laghdú

source: In certain circumstances your employer may ask for a reduction of your working hours or pay
ga: I gcásanna áirithe d'fhéadfadh fostóir iarraidh ort laghdú pá a thógáil nó níos lú uaireanta a oibriú

source: This is a change to your contract of employment
ga: Seo athrú ar do théarmaí agus coinníollacha fostaíochta

source: Most Read in "Employment"
ga: Ábhar is mó éilimh i "Fostaíocht"

source: Rest periods and breaks
ga: Tréimhsí sosa agus sosanna

source: Tax and starting work - PAYE
ga: Gnó a chur ar bun
